from typing import List
from langchain_core.documents import Document

faqs=[
    {
        "question": "שכחתי את הסיסמה האישית שלי, מה עליי לעשות?",
        "answer": "עלייך להרשם מחדש לשירות."
    },
    {
        "question": "החלפתי מכשיר טלפון, אפשר להתחבר שוב ל- bit?",
        "answer": "כן. יש להוריד את האפליקציה מחדש, להזדהות באמצעות מספר הטלפון והסיסמא האישית שלך."
    },
    {
        "question": "אפשר לשנות את מספר חשבון בנק לזיכוי ופרטי כרטיס חיוב?",
        "answer": "כן. ניתן לעדכן פרטי כרטיס חיוב שהונפק על ידי תאגיד בנקאי ישראלי או חברת כרטיסי אשראי ישראלית ולהוסיף  להסיר חשבון בנק (עוש) בלבד בתאגיד בנקאי ישראלי."
    },
    {
        "question": "עם איזה כרטיס חיוב אפשר להשתמש כדי להעביר כסף ב- bit?",
        "answer": "כרטיס חיוב על שם המשתמש שהונפק על ידי תאגיד בנקאי ישראלי או חברת כרטיסי אשראי ישראלית (כולל כרטיסים לחיוב מיידי וכרטיסים נטענים)."
    },
    {
        "question": "אפשר להעביר כסף באמצעות כרטיס חיוב של מישהו אחר?",
        "answer": "לא. ניתן להזין כרטיס חיוב על שם המשתמש הרשום לשירות."
    },
    {
        "question": "איך אפשר למחוק את הרישוםאת הפרופיל?",
        "answer": "נכנסים לצפייה בפרופיל בצד ימין למעלה במסך הראשי>>>לוחצים על כפתור מחק פרופילרישום מחדש.חשוב להבין! ברגע שמוחקים את הרישום לאפליקציית bit כל היסטורית העברות וקבלות כספים נמחקת גם. אם תרשם מחדש בפעם אחרת, לא תוכל לראות את ההיסטוריה."
    },
    {
        "question": "מה קורה אם הטלפון שלי לא ברשותי, כי הוא נמסר לתיקון, נגנב או אבד?",
        "answer": "השירות מאובטח ודורש את הזיהוי שלך (באמצעות טביעת אצבע או הקלדת סיסמה) כתנאי לביצוע התשלום. בכל מקרה, עליך להתקשר אלינו למספר *6428 בהקדם ולבקש לחסום את השירות בטרם מסירת הטלפון לתיקון."
    },
    {
        "question": "מהו כרטיס אשראי Carrefour club?",
        "answer": "כרטיס Carrefour club הינו כרטיס אשראי חוץ בנקאי המונפק עי חברת כאל ובאחריותה ובמסגרתו לקוחות רשת Carrefour, ורשתות נוספות המופרטות באתר קבוצת אלקטרה יוכלו ליהנות מהטבות. כמו כן, ניתן לצבור ברכישות בכרטיס מחוץ לרשתות המועדון ובהעברות באפליקציות (הכרוכות בשימוש בכרטיס) 0.3% מסכום הרכישה או מהסכום המועבר. את הכרטיס מנפיקים בתהליך דיגיטלי קצר באמצעות הפניה מאפליקציית bit למנפיקת הכרטיס כאל, ותוך מספר דקות ניתן להתחיל להשתמש בכרטיס הווירטואלי, עד לקבלת הכרטיס הפיזי בדואר. פרטים נוספים לגבי מועדון Carrefour Club ורשתות המועדון ניתן למצוא באתר המועדון בכתובתhttps:brand.carrefour.co.ilclubפרטים על הכרטיס ניתן למצוא באתר כאל בכתובתhttps:www.cal-online.co.ilcardscarrefour"
    },
    {
        "question": "כמה זה עולה לי?",
        "answer": "למנפיקי כרטיס אשראי Carrefour club העלות הינה בהתאם לתעריפון חברת כאל ובאחריותה, כאשר בשנה הראשונה (ממועד הנפקת הכרטיס) יש פטור מלא מעמלת דמי כרטיס. מחזיקי כרטיס אשראי bitcard ימשיכו ליהנות מההטבה שניתנה להם במועד ההנפקה בעמלת דמי הכרטיס, וזאת עד לתום תקופת ההטבה."
    },
    {
        "question": " Carrefour club למה צריך כרטיס אשראי ?",
        "answer": "כרטיס אשראי Carrefour club נותן הטבות לחברי Carrefour club, כגון צבירה של +Carrefour coins ברכישות בכרטיס ומתנות הצטרפות, והכול בכפוף לתקנון התכנית ותנאי ההטבות. את ה +Carrefour coins ניתן יהיה לממש ברכישות בישראל ברשת קארפור וברשתות נוספות בתשלובת אלקטרה. ברשתות בינלאומיות ההטבות המועדון יוענקו או יממושו בסניפים בישראל בלבד.מחזיקי כרטיס אשראי Carrefour Club יוכלו לצבור +Carrefour coins ולממש ברשתות המועדון את המטבעות שצברו, וזאת באמצעות הפקת שוברברקוד תשלום (המופק על ידי המועדון ובאחריותו) על סכום הצבירה או חלקו, והכול בכפוף לתקנון המועדון. השוברברקוד יוצג ללקוח באמצעות אפליקציית מועדון, אפליקציית bit ואו באמצעות אמצעי אחר לפי החלטת המועדון. בנוסף, מנפיקי כרטיס אשראי Carrefour club ייהנו מפטור מדמי הכרטיס לשנה הראשונה.לינק לתקנון המועדון באתר,https:brand.carrefour.co.ilclubאת הטבות הכרטיס אפשר לראות בכאלמועדון בכתובתhttps:www.cal-online.co.ilcardscarrefour"
    },
    {
        "question": "כיצד ניתן לממש את +Carrefour coins?",
        "answer": "ניתן לממש את ה +Carrefour coins ובלבד שצברת כמות מינימום של 30 +Carrefour coins.את ה +Carrefour coins ניתן לממש ברכישות בישראל ברשת קרפור וברשתות נוספות בתשלובת אלקטרה, בכפוף לתקנון המועדון. ברשתות בינלאומיות הטבות המועדון יוענקו או ימומשו בסניפים בישראל בלבד.המימוש יתאפשר בדרך של הפקת שוברברקוד, המונפק על ידי המועדון ובאחריותו, שיוצג לך באמצעות אמצעי אחר כפי שיהיה מעת לעת לפי החלטת המועדון. את הברקוד יש להציג בקופה.לאחר המימוש, יתרת ה +Carrefour coins שלך תתעדכן בהתאם לגובה המימוש.המידע בעניין ה +Carrefour coins מתקבל ממועדון Carrefour Club והוא האחראי הבלעדי לנכונות הנתונים. הבנק אינו המנפיק או המתפעל של מטבעות +Carrefour coins או של קוד המימוש ואינו מתחייב למימוש המטבעות (חלקי או מלא) או לביצוע כל הוראה או פעולה אחרת באמצעותם. מועדון Carrefour Club הוא האחראי לשירותים אלו ובכלל זה לניהול כמות המטבעות, תוקפם, הצבירה ומימושם (לרבות באמצעות קוד המימוש) ולא הבנק. לפרטים נוספים ראותקנון מועדוןכרטיס האשראי Carrefour Club."
    },
    {
        "question": "כמה כל +Carrefour coins שווה?",
        "answer": "כל +Carrefour coins אחד שווה ערך ל- 1 ₪ למימוש ברכישות בישראל ברשת קרפור וברשתות נוספות בתשלובת אלקטרה, והכל כמפורט ובכפוף לתקנון המועדון. ברשתות בינלאומיות הטבות המועדון יוענקו או ימומשו בסניפים בישראל בלבד."
    },
    {
        "question": "היכן ניתן לראות את יתרת הצבירה של +Carrefour coins?",
        "answer": "יתרת הצבירה של ה +Carrefour coins משוקפת באפליקצייתמועדון קארפור. סך צבירת המטבעות מחושב על סמך רכישות בכרטיס, שבוצעו עד 15 ימי עסקים ממועד הרכישה, בהפחתת סך המטבעות שמומשו נכון להיום.המידע בעניין המטבעות מוצג לנוחיות המשתמש בלבד. המידע מתקבל ממועדון Carrefour Club שהינו האחראי הבלעדי לנכונות הנתונים, לצבירת המטבעות, לחישוב צבירתם, תוקפם, ניהולם, שמירתם ואו פריקתם ומימושם ואו ליכולת השימוש בהם.לצורך קבלת המידע המלא ביחס למספר המטבעות שנצבר למשתמש ואו כל פרט אחר הנוגע להן, על המשתמש לפנות לשירות הלקוחות של מועדון כרטיס Carrefour Club בטלפון 9484* ואו לכאל מנפיקת כרטיס Carrefour Club בטלפון 03-5726444."
    },
    {
        "question": " Carrefour club אז איך מצטרפים?",
        "answer": "תהליך הנפקת כרטיס האשראי Carrefour club מתבצע באופן דיגיטלי באמצעות הפניה מאפליקציית bit למנפיקת הכרטיס כאל. תהליך ההנפקה יחל רק לאחר שתקליד את סיסמת ה-bit שלך, ותזדהה גם מול המנפיקה - חברת כאל. בתום תהליך ההנפקה יעודכן באופן אוטומטי כרטיס אשראי Carrefour club ככרטיס הראשי באפליקציית bit. תוכל כמובן לשנות את הכרטיס הראשי באפליקציה בכל עת בתפריט ההגדרות באפליקציה."
    },
    {
        "question": " Carrefour club מי נותן שירות ותמיכה?",
        "answer": "המוקד לשירות ותמיכה בעניינים הקשורים ל- bit זמין בטלפון 6428* בימים א עד ה בין השעות 9:00-17:00 ובימי ו בין השעות 8:30-13:00. לשאלות לגביהמועדון יש לפנות למוקד התמיכה של המועדון 9484*, לשאלות על הכרטיס יש לפנות למוקד לקוחות של כאל בטלפון: 03-5726444"
    },
    {
        "question": "האם יש מגבלות על סכום ההזמנה?",
        "answer": "השירות ניתן בהתאם לתנאי הבנק ותנאי השימוש באפליקציית bit.נכון למועד זה, סכום המטח המינימלי להזמנה באמצעות bit הוא 200 ₪. הסכום המצטבר ליום שניתן להזמין באמצעות bit מוגבל לסך של חמשת אלפים (5,000) ₪. סכום המטח המצטבר לחודש קלנדרי שניתן להזמין באמצעות bit מוגבל לסך של עשרים אלף (20,000) ₪"
    },
    {
        "question": "מהם התנאים העדיפים הניתנים ללקוחות בנק הפועלים שיזמינו מטח ישירות מחשבונם?",
        "answer": "לקוחות פרטיים בבנק הפועלים יכולים להזמין מטח בטרמינל ישירות מחשבונם וליהנות מתנאים עדיפים: הטבות גבוהות יותר בעמלות, הזמנת מטח בסכומים גדולים יותר, חיוב חשבונם במטח או בשקלים על פי בחירתם, אפשרות איסוף המטח בטרמינל על ידי אחר."
    },
    {
        "question": "האם אפשר להזמין מטח עבור מישהו אחר?",
        "answer": "באמצעות bit אפשר להזמין מטח לטרמינל רק עבור משתמש bit (בעל כרטיס החיוב שחויב בהזמנה). המטח יימסר למזמין בהצגת תעודת הזהות או הדרכון."
    },
    {
        "question": "היכן אקבל את המט״ח שהזמנתי?",
        "answer": "המט״ח ימתין לך בכל אחד מדלפקי בנק הפועלים בדיוטי פרי, בטרמינלים 1 ו-3 בנתב״ג"
    },
    {
        "question": "מהן שעות פעילות הדלפקים בנתבג?",
        "answer": "הדלפקים פעילים בכל ימות השנה במשך 24 שעות ביממה, ומאוישים על ידי נציגות ונציגי בנק הפועלים (חוץ מביום כיפור)"
    },
    {
        "question": "הזמנתי מט״ח והטיסה שלי נדחתה. מה אפשר לעשות?",
        "answer": "המט״ח ימתין לך בדלפקי בנק הפועלים עד 4 ימי עסקים ממועד הטיסה שציינת בתהליך ההזמנה. אם הטיסה נדחתה למועד מאוחר יותר מכך, אפשר לעדכן את מועד הטיסה בהתאם בכל אחד מסניפי בנק הפועלים"
    },
    {
        "question": "מה קורה אם לא אספתי את המטח שהוזמן?",
        "answer": "המט״ח ימתין לך בדלפקי בנק הפועלים עד 4 ימי עסקים ממועד הטיסה שציינת בתהליך ההזמנה. בתום מועד זה, תבוטל ההזמנה באופן אוטומטי והכסף יוחזר לכרטיס החיוב שבאמצעותו בוצעה ההזמנה. בביטול ההזמנה לא תוחזר עמלת חליפין שחויבה במועד ההזמנה. כרטיס החיוב, שחויב בגין ההזמנה, יזוכה ביום עסקים בנקאי, בו מתקיים מסחר במטח, בסמוך לאחר הביטול, בשווי המטח בשקלים לפי שער חליפין מזומנים קניה, שיפורסם על ידי הבנק ביום הזיכוי (סכום שעשוי להיות נמוך מסכום השקלים שחויב בעת ההזמנה)."
    },
    {
        "question": "האם אפשר לבטל הזמנה?",
        "answer": "השירות ניתן עי בנק הפועלים. אפשר לבטל את ההזמנה בכל אחד מסניפי בנק הפועלים בלבד"
    },
    {
    "question": "איך אפשר לבקש כסף מקבוצה?",
    "answer": "במסך הפעולות הראשי יש אפשרות קבוצה, בוחרים באפשרות זו. ממשיכים לבחירת סיבת הבקשה (למה?) מתקדמים לבחירת הסכום (כמה מכל משתתף) והמועד להעברת הכסף (מתי?)"
},
{
    "question": "את מי אפשר לצרף לקבוצה?",
    "answer": "אפשר לצרף לקבוצה משתתפים מרשימת אנשי הקשר שבמכשירך. בנוסף, אפשר לצרף גם משתתפים שלא נמצאים במכשירך – באמצעות שיתוף הבקשה בהודעות ממכשיר הטלפון."
},
{
    "question": "כמה כסף אפשר לבקש מכל משתתף בקבוצה?",
    "answer": "סכום ההעברה המצטבר ליום מוגבל לסך של שלושת אלפים ושש מאות (3,600) ₪. על אף האמור, סכום ההעברה הראשונה שלאחר הרישום לשירות, ולמשך 24 שעות ממועד ביצוע ההעברה הראשונה כאמור, סכום ההעברה המצטבר יעמוד על אלף (1,000) ₪.סכום ההעברה החודשית המצטבר מוגבל לסך של שמונת אלפים ושלוש מאות (8,300) ₪.הסכום אותו ניתן לקבל באמצעות bit בשנה קלנדרית מוגבל לסך חמישים אלף (50,000) ₪ (לרבות קבלת כספים במסגרת איסוף בקבוצה).לקוח שחרג ממגבלת העברות כספים ואו קבלת כספים לא יוכל לבצע העברה נוספת ואו לאשר קבלת כספים נוספת עד למועד בו נסתיימה ההגבלה (יומית, חודשית או שנתית). סכומים אלו עשויים להתעדכן ולהשתנות מעת לעת, לרבות באמצעות מתן הודעה בתנאי שימוש אלו או באפליקציה"
},
{
    "question": "ביקשתי כסף מקבוצה ואני רוצה לצרף אליה משתתפים נוספים, זה אפשרי?",
    "answer": "כן, כל עוד הבקשה בתוקף ניתן לצרף לקבוצה משתתפים חדשים."
},
{
    "question": "יצרתי קבוצה ושלחתי לחבריה בקשה להעביר כסף, מה קורה עכשיו?",
    "answer": "כל משתתפי הקבוצה שהגדרת יקבלו הודעת sms (משתתפים שהעברת להם את הקישור יקבלו את ההודעה המכילה את פרטי בקשתך וקישור לאפליקציה). לחיצה על הקישור תעביר אותם למסך הצטרפות לקבוצה באפליקצייה. לאחר שיצטרפו יוכלו לבחור אם לאשר את הבקשה או לסרב לה."
},
{
    "question": "קיבלתי בקשה להצטרף לקבוצה ממישהו לא מוכר, מה לעשות?",
    "answer": "כדאי לבדוק אם חברי הקבוצה האחרים או פרטי הקבוצה מוכרים לך. ייתכן שמספר הטלפון של מקים הקבוצה (המבקש) לא מופיע ברשימת אנשי הקשר במכשירך. בכל מקרה כדאי לוודא היטב את זהות המבקש וסיבת הבקשה או פרטי הקבוצה לפני אישור הבקשה."
},
{
    "question": "קיבלתי הזמנה להצטרף לקבוצה ולהעביר כסף ב- bit, מה לעשות?",
    "answer": "לחיצה על הקישור שמצורף להודעה תעביר אותך ישירות למסך הבקשה באפליקציה, במסך זה תוכל להחליט אם להצטרף לקבוצה או לוותר. לאחר שהצטרפת לקבוצה תוכל לבחור אם להעביר את הכסף או לסרב לבקשה. בנוסף, כל עוד הבקשה בתוקף אפשר להכנס לבקשה גם ישירות מהאפליקציה."
},
{
    "question": "מתי אקבל את הכסף שנאסף בקבוצה לחשבון הבנק?",
    "answer": "הכסף יועבר לחשבונך לאחר שתוקף הבקשה יפוג (בהתאם למספר הימים שציינת להעברת הכספים בעת הקמת הקבוצה). במסך מתי אפשר להגדיר תוך כמה ימים הכסף יועבר. לחילופין, תוכל להעביר את הכסף לחשבונך בכל מועד לבחירתך כל עוד הקבוצה בתוקף."
},
{
    "question": "איך אדע מי העביר לי כסף?",
    "answer": "פעם ביום נעדכן אותך בהודעת sms על מספר משתתפי הקבוצה שהעבירו לך כסף ב- 24 השעות האחרונות. אפשר כמובן להכנס בכל רגע לאפליקציה ולראות מי העביר לך כסף או מי סרב לבקשתך. בנוסף, נשלח לך גם הודעת sms נפרדת בכל פעם שמישהו מחברי הקבוצה יסרב לבקשתך, וגם כאשר הכסף יועבר לחשבונך."
},
{
    "question": "האם חברי הקבוצה יכולים לראות מי העביר כסף ומי לא?",
    "answer": "חברי הקבוצה יראו את רשימת המשתתפים שהצטרפו לקבוצה, ואת הסכום הכולל שנאסף בקבוצה."
},
{
    "question": "תוך כמה זמן יוכלו משתתפי הקבוצה להעביר לי את הכסף?",
    "answer": "ניתן להגדיר עד 7 ימים לביצוע העברת הכספים. במסך מתי? בפתיחת בקשה קבוצתית תוכל להגדיר את מספר הימים לביצוע ההעברה."
},
{
    "question": "מה קורה אם אחד מחברי הקבוצה עדיין לא הוריד את bit?",
    "answer": "ההודעה שהוא יקבל תכיל קישור להורדת bit בחנות האפליקציות. לאחר הרשמה קצרה והצטרפות לקבוצה, הוא יוכל לראות את בקשתך באפליקציה ולאשר אותה או לסרב לה."
},
{
        "question": "כמה עולה להשתמש ב-bit?",
        "answer": "השימוש ב bit להעברות בין אנשים הוא ללא עלויות. חשוב לשים לב שבהתאם להסדר שלך עם הבנק שלך, ייתכן שבעת קבלת הכסף לחשבון העוש תחויב בעמלה."
    },
    {
        "question": "איך אפשר להעביר כסף?",
        "answer": "נכנסים אל העברה בוחרים את איש הקשר אליו רוצים להעביר (למי) מציינים את הסכום (כמה) מקלידים את הסיסמה או זיהוי ביומטרי ו.. הבקשה להעברת הכסף בדרך. רק כשמקבל ההעברה יאשר את הבקשה ההעברה תצא לפועל."
    },
    {
        "question": "כתבתי את סיבת ההעברה, מקבל הכסף יראה אותה?",
        "answer": "כן, סיבת ההעברה תוצג למקבל הכסף באפליקציה, ובפירוט התנועות בחשבון הבנק של מקבל הכסף."
    },
    {
        "question": "כמה כסף אפשר להעביר ב- bit?",
        "answer": "סכום ההעברה המצטבר ליום מוגבל לסך של שלושת אלפים ושש מאות (3,600) ₪. על אף האמור, סכום ההעברה הראשונהשלאחר הרישום לשירות, ולמשך 24 שעות ממועד ביצוע ההעברה הראשונה כאמור, סכום ההעברה המצטבר יעמוד על אלף (1,000) ₪.סכום ההעברה החודשית המצטבר מוגבל לסך של שמונת אלפים ושלוש מאות (8,300) ₪.הסכום אותו ניתן לקבל באמצעות bit בשנה קלנדרית מוגבל לסך חמישים אלף (50,000) ₪ (לרבות קבלת כספים במסגרת איסוף בקבוצה).לקוח שחרג ממגבלת העברות כספים ואו קבלת כספים לא יוכל לבצע העברה נוספת ואו לאשר קבלת כספים נוספת עד למועד בו נסתיימה ההגבלה (יומית, חודשית או שנתית).סכומים אלו עשויים להתעדכן ולהשתנות מעת לעת, לרבות באמצעות מתן הודעה בתנאי שימוש אלו או באפליקציה."
    },
    {
        "question": "העברתי כסף לאיש קשר. מתי יחויב כרטיס האשראי שלי?",
        "answer": "החיוב יתבצע במועד החיוב הרגיל של כרטיסך, רק לאחר אישור ההעברה על ידי איש הקשר."
    },
    {
        "question": "איך אוכל לדעת שהכסף שהעברתי התקבל בהצלחה?",
        "answer": "נודיע לך באמצעות SMS, כמו כן ניתן לראות את סטטוס ההעברה במסך הראשי של האפליקציה."
    },
    {
        "question": "מה קורה אם העברתי כסף לאיש קשר שעדין לא הוריד את האפליקציה?",
        "answer": "הוא יקבל הודעה שמזמינה אותו להרשם ל- bit. הבקשה לאשר את קבלת הכספים תמתין עבורו באפליקציה למשך שלושה ימים מהמועד שבו נשלח."
    },
    {
        "question": "העברתי כסף לאיש קשר והתחרטתי, האם אוכל לבטל?",
        "answer": "לא ניתן לבטל את ההעברה."
    },
    {
        "question": "אפשר להעביר כסף למי שלא מופיע באנשי קשר שלי?",
        "answer": "כן, נכנסים אל העברה, בוחרים בהעברה למספר שאינו באנשי הקשר או מקלידים מספר טלפון בשדה למי, מציינים את הסכום (כמה) מקלידים את הסיסמה או זיהוי ביומטרי ו.. הבקשה להעברת הכסף לאיש הקשר בדרך.חשוב להקפיד על הקלדה נכונה של מספר הטלפון של מקבל הבקשה."
    },
    {
        "question": "איך אקבל את הכסף שהעבירו לי?",
        "answer": "הכסף יועבר לחשבון הבנק שלך בהתאם לפרטים שציינת בעת ההרשמה. לפני קבלת כסף נבקש את אישורך. פרטי ההעברה יוצגו מידית באפליקציה. חשוב לשים לב שבהתאם להסדר שלך עם הבנק שלך, ייתכן שבעת קבלת הכסף לחשבון העוש תחויב בעמלה."
    },
    {
        "question": "איך אדע שהועבר אליי כסף?",
        "answer": "נודיע לך ב- SMS על בקשה להעברת כסף שנשלחה אליך. לאחר שתאשר את הבקשה, ההעברה תוצג במסך הראשי של האפליקציה."
    },
    {
        "question": "קיבלתי הודעה שנשלח אלי כסף, האם איש הקשר יוכל להתחרט ולבטל?",
        "answer": "לא ניתן לבטל את ההעברה."
    },
    {
        "question": "אישרתי בקשה לקבלת כסף באפליקציה אבל אני לא רואה את העברה בחשבון הבנק שלי, מה עושים?",
        "answer": "רצוי לבדוק את פרטי החשבון הרשומים באפליקציה, ולוודא שהם נכונים. במידה ופרטי החשבון הרשומים באפליקציה תקינים, כדאי להמתין יום עסקים נוסף מאישור הבקשה עד שההעברה תתעדכן בחשבון הבנק שלך. בכל שאלה נשמח לסייע לך בטלפון 6428*."
    },
    {
        "question": "קיבלתי בקשה לקבלת כסף ועוד לא נרשמתי לשירות, האם הכסף ילך לאיבוד?",
        "answer": "הבקשה להעברת הכסף תמתין שלושה ימים מיום שהשולח אישר את ההעברה. אם לא הספקת להרשם במועד ולאשר את הבקשה, הבקשה תתבטל והשולח לא יחוייב."
    },
    {
        "question": "מישהו העביר לי כסף בטעות, מה לעשות?",
        "answer": "אם איש הקשר שהעביר כסף אינו מוכר לך או מהות העברה לא ברורה לך, רצוי ללחוץ על סירוב במסך הרלוונטי באפליקציה. ההעברה תבוטל והכסף לא יעבור לחשבונך."
    },
    {
        "question": "bitהאם זה בטוח להעביר כסף ב?",
        "answer": "bit הינו שירות של בנק הפועלים, ופועל בסטנדרטים המקובלים של אבטחת מידע והגנה על הפרטיות."
    },
    {
        "question": "האם פרטי כרטיס האשראי או חשבון הבנק שלי חשופים לצד השני?",
        "answer": "לא, פרטי כרטיס האשראי או חשבון הבנק שלך חסויים והצד השני אינו חשוף להם."
    },
    {
        "question": "איך מבקשים כסף ב-bit?",
        "answer": "בוחרים את איש הקשר ממנו רוצים לבקש כסף. מקלידים את הסכום המבוקש ואת סיבת הבקשה (לא חובה). איש הקשר יקבל הודעת sms עם פרטי הבקשה ויבחר האם לאשר אותה או לא. במידה שבקשתך תאושר הכסף יועבר לחשבון שבחרת."
    },
    {
        "question": "העברתי בקשה לקבלת כסף לאיש קשר והוא אישר אותה, מתי חשבוני יזוכה?",
        "answer": "חשבונך יזוכה עד סוף יום העסקים הבא."
    },
    {
        "question": "איך אוכל לדעת אם הכסף שביקשתי הועבר אלי?",
        "answer": "נודיע לך ב-SMS בכל פעם שיעבירו לך כסף שביקשת. בנוסף, תוכל לראות זאת גם במסך הראשי של האפליקציה המציג את הפעולות שביצעת ב- bit."
    },
    {
        "question": "קיבלתי הודעה שבקשתי אושרה והכסף הועבר אליי, האם איש הקשר יכול להתחרט?",
        "answer": "לא ניתן לבטל את ההעברה."
    },
    {
        "question": "ביקשתי כסף מאיש קשר והתחרטתי האם אוכל לבטל את הבקשה?",
        "answer": "לא ניתן לבטל את הבקשה. אם איש הקשר לא יאשר את בקשתך בתוך 3 ימים היא תבוטל אוטומטית."
    },
    {
        "question": "מה קורה אם ביקשתי לקבל כסף מאיש קשר שעדיין לא הוריד את bit?",
        "answer": "הוא יקבל הודעת sms שמזמינה אותו להוריד את bit, בקשתך לקבלת כסף תמתין באפליקציה, והוא יוכל לאשר אותה תוך 3 ימים ממועד שליחתה."
    },
    {
        "question": "קיבלתי בקשה ממישהו לא מוכר, מה לעשות?",
        "answer": "יכול להיות שמספר הטלפון שלו אינו מופיע ברשימת אנשי הקשר במכשירך. בכל מקרה אנו ממליצים לוודא היטב את זהות המבקש ואת סיבת הבקשה לפני שתאשר את הבקשה. אם קיים חשש, במקום לאשר את הבקשה אפשר לסרב לה."
    },
    {
        "question": "קיבלתי בקשה להעברת כסף ואישרתי אותה, מתי יחויב כרטיס האשראי שלי?",
        "answer": "כרטיסך יחויב בהתאם למועד החיוב שבכרטיס האשראי"
    }
    ,
    {
        "question": "מי נותן שירות ותמיכה?",
        "answer": "המוקד לשירות ותמיכה בעניינים הקשורים ל- bit זמין בטלפון 6428* בימים א עד ה בין השעות 9:00-17:00 ובימי ו בין השעות 8:30-13:00. לשאלות לגביהמועדון יש לפנות למוקד התמיכה של המועדון 9484*, לשאלות על הכרטיס יש לפנות למוקד לקוחות של כאל בטלפון: 03-5726444"
    }
    
]



    
    
    
faqs1 = [{'question': 'האם יש מגבלות על סכום ההזמנה?',
             'answer': 'השירות ניתן בהתאם לתנאי הבנק ותנאי השימוש באפליקציית bit.נכון למועד זה, סכום המט"ח המינימלי להזמנה באמצעות bit הוא 200 ₪. הסכום המצטבר ליום שניתן להזמין באמצעות bit מוגבל לסך של חמשת אלפים (5,000) ₪. סכום המט"ח המצטבר לחודש קלנדרי שניתן להזמין באמצעות bit מוגבל לסך של עשרים אלף (20,000) ₪'}
        , {'question': 'מהם התנאים העדיפים הניתנים ללקוחות בנק הפועלים שיזמינו מט"ח ישירות מחשבונם?',
           'answer': 'לקוחות פרטיים בבנק הפועלים יכולים להזמין מט"ח בטרמינל ישירות מחשבונם וליהנות מתנאים עדיפים: הטבות גבוהות יותר בעמלות, הזמנת מט"ח בסכומים גדולים יותר, חיוב חשבונם במט"ח או בשקלים על פי בחירתם, אפשרות איסוף המט"ח בטרמינל על ידי אחר.'}
        , {'question': 'האם אפשר להזמין מט"ח עבור מישהו אחר?',
           'answer': 'באמצעות bit אפשר להזמין מט"ח לטרמינל רק עבור משתמש bit (בעל כרטיס החיוב שחויב בהזמנה). המט"ח יימסר למזמין בהצגת תעודת הזהות או הדרכון.'}
        , {'question': 'היכן אקבל את המט״ח שהזמנתי?',
           'answer': 'המט״ח ימתין לך בכל אחד מדלפקי בנק הפועלים בדיוטי פרי, בטרמינלים 1 ו-3 בנתב״ג'}
        , {'question': 'מהן שעות פעילות הדלפקים בנתב"ג?',
           'answer': 'הדלפקים פעילים בכל ימות השנה במשך 24 שעות ביממה, ומאוישים על ידי נציגות ונציגי בנק הפועלים (חוץ מביום כיפור)'}
        , {'question': 'הזמנתי מט״ח והטיסה שלי נדחתה. מה אפשר לעשות?',
           'answer': 'המט״ח ימתין לך בדלפקי בנק הפועלים עד 4 ימי עסקים ממועד הטיסה שציינת בתהליך ההזמנה. אם הטיסה נדחתה למועד מאוחר יותר מכך, אפשר לעדכן את מועד הטיסה בהתאם בכל אחד מסניפי בנק הפועלים'}
        , {'question': 'מה קורה אם לא אספתי את המט"ח שהוזמן?',
           'answer': 'המט״ח ימתין לך בדלפקי בנק הפועלים עד 4 ימי עסקים ממועד הטיסה שציינת בתהליך ההזמנה. בתום מועד זה, תבוטל ההזמנה באופן אוטומטי והכסף יוחזר לכרטיס החיוב שבאמצעותו בוצעה ההזמנה. בביטול ההזמנה לא תוחזר עמלת חליפין שחויבה במועד ההזמנה. כרטיס החיוב, שחויב בגין ההזמנה, יזוכה ביום עסקים בנקאי, בו מתקיים מסחר במט"ח, בסמוך לאחר הביטול, בשווי המט"ח בשקלים לפי שער חליפין "מזומנים קניה", שיפורסם על ידי הבנק ביום הזיכוי (סכום שעשוי להיות נמוך מסכום השקלים שחויב בעת ההזמנה).'}
        , {'question': 'האם אפשר לבטל הזמנה?',
           'answer': 'השירות ניתן ע"י בנק הפועלים. אפשר לבטל את ההזמנה בכל אחד מסניפי בנק הפועלים בלבד'}
        , {'question': 'כמה עולה להשתמש ב-bit?',
           'answer': 'השימוש ב bit להעברות בין אנשים הוא ללא עלויות. חשוב לשים לב שבהתאם להסדר שלך עם הבנק שלך, ייתכן שבעת קבלת הכסף לחשבון העו"ש תחויב בעמלה.'}
        , {'question': 'איך אפשר להעביר כסף?',
           'answer': 'נכנסים אל "העברה" בוחרים את איש הקשר אליו רוצים להעביר ("למי") מציינים את הסכום ("כמה") מקלידים את הסיסמה או זיהוי ביומטרי ו.. הבקשה להעברת הכסף בדרך. רק כשמקבל ההעברה יאשר את הבקשה ההעברה תצא לפועל.'}
        , {'question': 'כתבתי את סיבת ההעברה, מקבל הכסף יראה אותה?',
           'answer': 'כן, סיבת ההעברה תוצג למקבל הכסף באפליקציה, ובפירוט התנועות בחשבון הבנק של מקבל הכסף.'}
        , {'question': 'כמה כסף אפשר להעביר?',
           'answer': 'סכום ההעברה המצטבר ליום מוגבל לסך של שלושת אלפים ושש מאות (3,600) ₪. על אף האמור, סכום ההעברה הראשונהשלאחר הרישום לשירות, ולמשך 24 שעות ממועד ביצוע ההעברה הראשונה כאמור, סכום ההעברה המצטבר יעמוד על אלף (1,000) ₪.סכום ההעברה החודשית המצטבר מוגבל לסך של שמונת אלפים ושלוש מאות (8,300) ₪.הסכום אותו ניתן לקבל באמצעות bit בשנה קלנדרית מוגבל לסך חמישים אלף (50,000) ₪ (לרבות קבלת כספים במסגרת איסוף בקבוצה).לקוח שחרג ממגבלת העברות כספים ו/או קבלת כספים לא יוכל לבצע העברה נוספת ו/או לאשר קבלת כספים נוספת עד למועד בו נסתיימה ההגבלה (יומית, חודשית או שנתית).סכומים אלו עשויים להתעדכן ולהשתנות מעת לעת, לרבות באמצעות מתן הודעה בתנאי שימוש אלו או באפליקציה.'}

        , {'question': '       לא מצאתי את העברת הכסף שביצעתי אתמול בביט',
           'answer': 'יש לפנות למוקד ביטניתן לפנות אלינו בטלפון 6428*'}

        , {'question': 'העברתי כסף לאיש קשר. מתי יחויב כרטיס האשראי שלי?',
           'answer': 'החיוב יתבצע במועד החיוב הרגיל של כרטיסך, רק לאחר אישור ההעברה על ידי איש הקשר.'}
        , {'question': 'איך אוכל לדעת שהכסף שהעברתי התקבל בהצלחה?',
           'answer': 'נודיע לך באמצעות SMS, כמו כן ניתן לראות את סטטוס ההעברה במסך הראשי של האפליקציה.'}
        , {'question': 'מה קורה אם העברתי כסף לאיש קשר שעדין לא הוריד את האפליקציה?',
           'answer': 'הוא יקבל הודעה שמזמינה אותו להרשם ל- bit. הבקשה לקבלת הכסף תמתין עבורו באפליקציה למשך שלושה ימים מהמועד שבו נשלח.'}
        , {'question': 'העברתי כסף לאיש קשר והתחרטתי, האם אוכל לבטל?', 'answer': 'לא ניתן לבטל את ההעברה.'}
        , {'question': 'אפשר להעביר כסף למי שלא מופיע באנשי קשר שלי?',
           'answer': 'כן, נכנסים אל "העברה", בוחרים ב"העברה למספר שאינו באנשי הקשר" או מקלידים מספר טלפון בשדה "למי", מציינים את הסכום ("כמה") מקלידים את הסיסמה או זיהוי ביומטרי ו.. הבקשה להעברת הכסף לאיש הקשר בדרך.חשוב להקפיד על הקלדה נכונה של מספר הטלפון של מקבל הבקשה.'}
        , {'question': 'איך אקבל את הכסף שהעבירו לי?',
           'answer': 'הכסף יועבר לחשבון הבנק שלך בהתאם לפרטים שציינת בעת ההרשמה. לפני קבלת כסף נבקש את אישורך. פרטי ההעברה יוצגו מידית באפליקציה. חשוב לשים לב שבהתאם להסדר שלך עם הבנק שלך, ייתכן שבעת קבלת הכסף לחשבון העו"ש תחויב בעמלה.'}
        , {'question': 'איך אדע שהועבר אליי כסף?',
           'answer': 'נודיע לך ב- SMS על בקשה להעברת כסף שנשלחה אליך. לאחר שתאשר את הבקשה, ההעברה תוצג במסך הראשי של האפליקציה.'}
        , {'question': 'קיבלתי הודעה שנשלח אלי כסף, האם איש הקשר יוכל להתחרט ולבטל?',
           'answer': 'לא ניתן לבטל את ההעברה.'}
        , {'question': 'אישרתי בקשה לקבלת כסף באפליקציה אבל אני לא רואה את העברה בחשבון הבנק שלי, מה עושים?',
           'answer': 'רצוי לבדוק את פרטי החשבון הרשומים באפליקציה, ולוודא שהם נכונים. במידה ופרטי החשבון הרשומים באפליקציה תקינים, כדאי להמתין יום עסקים נוסף מאישור הבקשה עד שההעברה תתעדכן בחשבון הבנק שלך. בכל שאלה נשמח לסייע לך בטלפון 6428*.'}
        , {'question': 'קיבלתי בקשה לקבלת כסף ועוד לא נרשמתי לשירות, האם הכסף ילך לאיבוד?',
           'answer': 'הבקשה להעברת הכסף תמתין שלושה ימים מיום שהשולח אישר את ההעברה. אם לא הספקת להרשם במועד ולאשר את הבקשה, הבקשה תתבטל והשולח לא יחוייב.'}
        , {'question': 'מישהו העביר לי כסף בטעות, מה לעשות?',
           'answer': 'אם איש הקשר שהעביר כסף אינו מוכר לך או מהות העברה לא ברורה לך, רצוי ללחוץ על "סירוב" במסך הרלוונטי באפליקציה. ההעברה תבוטל והכסף לא יעבור לחשבונך.'}
        , {'question': 'האם זה בטוח להעביר כסף ב-bit?',
           'answer': 'bit הינו שירות של בנק הפועלים, ופועל בסטנדרטים המקובלים של אבטחת מידע והגנה על הפרטיות.'}
        , {'question': 'האם פרטי כרטיס האשראי או חשבון הבנק שלי חשופים לצד השני?',
           'answer': 'לא, פרטי כרטיס האשראי או חשבון הבנק שלך חסויים והצד השני אינו חשוף להם.'}
        , {'question': 'איך מבקשים כסף ב-bit?',
           'answer': 'בוחרים את איש הקשר ממנו רוצים לבקש כסף. מקלידים את הסכום המבוקש ואת סיבת הבקשה (לא חובה). איש הקשר יקבל הודעת sms עם פרטי הבקשה ויבחר האם לאשר אותה או לא. במידה שבקשתך תאושר הכסף יועבר לחשבון שבחרת.'}
        , {'question': 'העברתי בקשה לקבלת כסף לאיש קשר והוא אישר אותה, מתי חשבוני יזוכה?',
           'answer': 'חשבונך יזוכה עד סוף יום העסקים הבא.'}
        , {'question': 'איך אוכל לדעת אם הכסף שביקשתי הועבר אלי?',
           'answer': 'נודיע לך ב-SMS בכל פעם שיעבירו לך כסף שביקשת. בנוסף, תוכל לראות זאת גם במסך הראשי של האפליקציה המציג את הפעולות שביצעת ב- bit.'}

            ################################################

        , {'question': 'העברת כסף בטעות',
           'answer': 'לא ניתן לבטל את העברה,להמשך בירור ניתן לפנות למוקד ביט Bit *6428'}

        , {'question': 'האם ניתן להעביר דולרים או כל מטבע אחר בביט',
           'answer': 'באפליקציית ביט ניתן להעביר רק שקלים שח'}

            ############################################
        , {'question': 'קיבלתי הודעה שבקשתי אושרה והכסף הועבר אליי, האם איש הקשר יכול להתחרט?',
           'answer': 'לא ניתן לבטל את ההעברה.'}
        , {'question': 'ביקשתי כסף מאיש קשר והתחרטתי האם אוכל לבטל את הבקשה?',
           'answer': 'לא ניתן לבטל את הבקשה. אם איש הקשר לא יאשר את בקשתך בתוך 3 ימים היא תבוטל אוטומטית.'}
        , {'question': 'מה קורה אם ביקשתי לקבל כסף מאיש קשר שעדיין לא הוריד את bit?',
           'answer': 'הוא יקבל הודעת sms שמזמינה אותו להוריד את bit, בקשתך לקבלת כסף תמתין באפליקציה, והוא יוכל לאשר אותה תוך 3 ימים ממועד שליחתה.'}
        , {'question': 'קיבלתי בקשה ממישהו לא מוכר, מה לעשות?',
           'answer': 'יכול להיות שמספר הטלפון שלו אינו מופיע ברשימת אנשי הקשר במכשירך. בכל מקרה אנו ממליצים לוודא היטב את זהות המבקש ואת סיבת הבקשה לפני שתאשר את הבקשה. אם קיים חשש, במקום לאשר את הבקשה אפשר לסרב לה.'}
        , {'question': 'קיבלתי בקשה להעברת כסף ואישרתי אותה, מתי יחויב כרטיס האשראי שלי?',
           'answer': 'החיוב יתבצע בהתאם למועד שהגדרת בכרטיס האשראי שלך.'}
        , {'question': 'איך אפשר לבקש כסף מקבוצה?',
           'answer': 'במסך הפעולות הראשי יש אפשרות "קבוצה", בוחרים באפשרות זו. ממשיכים לבחירת סיבת הבקשה ("למה?") מתקדמים לבחירת הסכום ("כמה מכל משתתף") והמועד להעברת הכסף ("מתי?")'}
        , {'question': 'את מי אפשר לצרף לקבוצה?',
           'answer': 'אפשר לצרף לקבוצה משתתפים מרשימת אנשי הקשר שבמכשירך. בנוסף, אפשר לצרף גם משתתפים שלא נמצאים במכשירך – באמצעות שיתוף הבקשה בהודעות ממכשיר הטלפון.'}
        , {'question': 'כמה כסף אפשר לבקש מכל משתתף בקבוצה?',
           'answer': 'סכום ההעברה המצטבר ליום מוגבל לסך של שלושת אלפים ושש מאות (3,600) ₪. על אף האמור, סכום ההעברה הראשונה שלאחר הרישום לשירות, ולמשך 24 שעות ממועד ביצוע ההעברה הראשונה כאמור, סכום ההעברה המצטבר יעמוד על אלף (1,000) ₪.סכום ההעברה החודשית המצטבר מוגבל לסך של שמונת אלפים ושלוש מאות (8,300) ₪.הסכום אותו ניתן לקבל באמצעות bit בשנה קלנדרית מוגבל לסך חמישים אלף (50,000) ₪ (לרבות קבלת כספים במסגרת איסוף בקבוצה).לקוח שחרג ממגבלת העברות כספים ו/או קבלת כספים לא יוכל לבצע העברה נוספת ו/או לאשר קבלת כספים נוספת עד למועד בו נסתיימה ההגבלה (יומית, חודשית או שנתית). סכומים אלו עשויים להתעדכן ולהשתנות מעת לעת, לרבות באמצעות מתן הודעה בתנאי שימוש אלו או באפליקציה'}
        , {'question': 'ביקשתי כסף מקבוצה ואני רוצה לצרף אליה משתתפים נוספים, זה אפשרי?',
           'answer': 'כן, כל עוד הבקשה בתוקף ניתן לצרף לקבוצה משתתפים חדשים.'}
        , {'question': 'יצרתי קבוצה ושלחתי לחבריה בקשה להעביר כסף, מה קורה עכשיו?',
           'answer': 'כל משתתפי הקבוצה שהגדרת יקבלו הודעת sms (משתתפים שהעברת להם את הקישור יקבלו את ההודעה המכילה את פרטי בקשתך וקישור לאפליקציה). לחיצה על הקישור תעביר אותם למסך הצטרפות לקבוצה באפליקצייה. לאחר שיצטרפו יוכלו לבחור אם לאשר את הבקשה או לסרב לה.'}
        , {'question': 'קיבלתי בקשה להצטרף לקבוצה ממישהו לא מוכר, מה לעשות?',
           'answer': 'כדאי לבדוק אם חברי הקבוצה האחרים או פרטי הקבוצה מוכרים לך. ייתכן שמספר הטלפון של מקים הקבוצה (המבקש) לא מופיע ברשימת אנשי הקשר במכשירך. בכל מקרה כדאי לוודא היטב את זהות המבקש וסיבת הבקשה או פרטי הקבוצה לפני אישור הבקשה.'}
        , {'question': 'קיבלתי הזמנה להצטרף לקבוצה ולהעביר כסף ב- bit, מה לעשות?',
           'answer': 'לחיצה על הקישור שמצורף להודעה תעביר אותך ישירות למסך הבקשה באפליקציה, במסך זה תוכל להחליט אם להצטרף לקבוצה או לוותר. לאחר שהצטרפת לקבוצה תוכל לבחור אם להעביר את הכסף או לסרב לבקשה. בנוסף, כל עוד הבקשה בתוקף אפשר להכנס לבקשה גם ישירות מהאפליקציה.'}
        , {'question': 'מתי אקבל את הכסף שנאסף בקבוצה לחשבון הבנק?',
           'answer': 'הכסף יועבר לחשבונך לאחר שתוקף הבקשה יפוג (בהתאם למספר הימים שציינת להעברת הכספים בעת הקמת הקבוצה). במסך "מתי" אפשר להגדיר תוך כמה ימים הכסף יועבר. לחילופין, תוכל להעביר את הכסף לחשבונך בכל מועד לבחירתך כל עוד הקבוצה בתוקף.'}
        , {'question': 'איך אדע מי העביר לי כסף?',
           'answer': 'פעם ביום נעדכן אותך בהודעת sms על מספר משתתפי הקבוצה שהעבירו לך כסף ב- 24 השעות האחרונות. אפשר כמובן להכנס בכל רגע לאפליקציה ולראות מי העביר לך כסף או מי סרב לבקשתך. בנוסף, נשלח לך גם הודעת sms נפרדת בכל פעם שמישהו מחברי הקבוצה יסרב לבקשתך, וגם כאשר הכסף יועבר לחשבונך.'}
        , {'question': 'האם חברי הקבוצה יכולים לראות מי העביר כסף ומי לא?',
           'answer': 'חברי הקבוצה יראו את רשימת המשתתפים שהצטרפו לקבוצה, ואת הסכום הכולל שנאסף בקבוצה.'}
        , {'question': 'תוך כמה זמן יוכלו משתתפי הקבוצה להעביר לי את הכסף?',
           'answer': "ניתן להגדיר עד 7 ימים לביצוע העברת הכספים. במסך 'מתי?' בפתיחת בקשה קבוצתית תוכל להגדיר את מספר הימים לביצוע ההעברה."}
        , {'question': 'מה קורה אם אחד מחברי הקבוצה עדיין לא הוריד את bit?',
           'answer': 'ההודעה שהוא יקבל תכיל קישור להורדת bit בחנות האפליקציות. לאחר הרשמה קצרה והצטרפות לקבוצה, הוא יוכל לראות את בקשתך באפליקציה ולאשר אותה או לסרב לה.'}
        , {'question': 'מה זה תשלום בהצמדת הנייד לקופה?',
           'answer': 'תשלום בהצמדת הנייד לקופה הוא דרך מתקדמת לשלם בחנויות: מקרבים את הנייד למסוף בקופה וזהו - התשלום מתבצע. אפשר לשלם בהצמדת הנייד לקופה עם bit במהירות ובצורה מאובטחת בכל חנות בישראל ובחו"ל, שבה מותקנות קופות התומכות בשירות.'}
        , {'question': 'מי יכול לשלם בהצמדת הנייד לקופה עם bit?',
           'answer': 'התשלום בהצמדת הנייד לקופה עם bit זמין במכשירי אנדרואיד תומכים בשירות בלבד, עבור לקוחות bit שמחזיקים בכרטיס חיוב שאושר לשימוש: כרטיס מאסטרקארד של בנק הפועלים, כרטיס חוץ בנקאי של ישראכרט ו/או בכרטיס bitcard.'}
        , {'question': 'איפה אפשר לשלם בהצמדת הנייד לקופה?',
           'answer': 'התשלום בהצמדת הנייד לקופה אפשרי בכל חנות שמותקנת בה קופה התומכת בשירות. על קופות שתומכות בשירות מופיע סימן בצורת קשתות (הסימן דומה לאייקון של wifi).'}
        , {'question': 'איך משלמים בהצמדת הנייד לקופה?',
           'answer': 'אפשר לשלם בהצמדת הנייד לקופה בכל החנויות שתומכות בשירות. כל מה שצריך לעשות הוא לפתוח את נעילת המסך בנייד, לקרב את הנייד למסוף בקופה וזהו - התשלום מתבצע.אין צורך לפתוח את bit או להקליד את הקוד הסודי של כרטיס האשראי. אם אין לך נעילת מסך, לאחר קירוב הנייד למסוף יקפוץ מסך הסיסמה של bit. בשלב זה יש להזין את הסיסמה (בהקלדה או בטביעת אצבע) ולהצמיד שנית את הנייד לקופה.'}
        , {'question': 'אין לי רכיב NFC במכשיר. האם בכל זאת אוכל לשלם בהצמדת הנייד לקופה?',
           'answer': 'לצערנו, לא ניתן לשלם בהצמדת הנייד לקופה ללא רכיב NFC.'}
        , {'question': 'האם צריך להקליד את הקוד הסודי של כרטיס האשראי כשמשלמים בהצמדת הנייד לקופה עם bit?',
           'answer': 'לא, אין צורך בהקלדת הקוד הסודי.'}
        , {'question': 'האם ניתן לשלם בהצמדת הנייד לקופה עם bit גם בחו"ל?',
           'answer': 'התשלום בהצמדת הנייד לקופה מבוסס על תקן בינלאומי של ויזה ומאסטרקארד. לכן אפשר לשלם בהצמדת הנייד לקופה גם בחו"ל, בכל מסוף תשלום התומך בשירות.'}
        , {'question': 'האם התשלום בהצמדת הנייד לקופה עם bit כרוך בעמלה מיוחדת?',
           'answer': 'לא. זוהי פעולה ללא תוספת תשלום או עמלה.'}
        , {'question': 'מה קורה אם הטלפון שלי לא ברשותי, כי הוא נמסר לתיקון, נגנב או אבד?',
           'answer': 'השירות מאובטח ודורש את הזיהוי שלך (באמצעות טביעת אצבע או הקלדת סיסמה) כתנאי לביצוע התשלום. בכל מקרה, מומלץ להתקשר אלינו למספר 6428* בשעות הפעילות ולבקש לחסום את השירות בטרם מסירת הטלפון לתיקון.'}
        , {'question': 'מה זה bitcard?',
           'answer': 'ביטקארד הינו כרטיס אשראי חוץ בנקאי המונפק ע"י חברת כאל ובאחריותה (חברת כאל מעמידת האשראי).אי עמידה בפירעון ההלוואה או בפירעון האשראי בכרטיס אשראי, עלול לגרור חיוב בריבית פיגורים והליכי הוצאה לפועל. שם המלווה (מעמיד האשראי): כרטיסי אשראי לישראל בע"מ (כאל).הנפקה ע"י כאל ע"פ שיקול דעתה ובאחריותה. על ההנפקה והשימוש בו יחולו "תנאי הסכם ההצטרפות לקבלת כרטיס אשראי" של כאל.'}
        , {'question': 'כמה עולה לי כרטיס bitcard?',
           'answer': 'עלות כרטיס אשראי bitcard היא בהתאם לתעריפון חברת כאל. לפירוט באתר bitcard בכתובת:https://www.bitpay.co.il/bitcardאי עמידה בפירעון ההלוואה או בפירעון האשראי בכרטיס אשראי, עלול לגרור חיוב בריבית פיגורים והליכי הוצאה לפועל. שם המלווה (מעמיד האשראי): כרטיסי אשראי לישראל בע"מ (כאל). הנפקה ע"י כאל ע"פ שיקול דעתה ובאחריותה. על ההנפקה והשימוש בכרטיס יחולו "תנאי הסכם ההצטרפות לקבלת כרטיס אשראי" של כאל'}
        , {'question': 'כיצד ניתן לקבל שירות ותמיכה באפליקצייה?',
           'answer': "המוקד שלנו זמין בטלפון 03-5723833 בימים א' עד ה' בין השעות 8:30 עד 16:00. על מנת להקל עליך, ניתן תמיד לחייג למוקד ביט בטלפון *6428 ולהקיש 2 לתמיכה בנושא כרטיס bitcard."}
        , {'question': 'כיצד ניתן לצפות בקוד הסודי של הכרטיס?',
           'answer': 'דרך אפליקציית bit - ניתן ללחוץ על "הצגת קוד סודי" במסך \'כרטיס לחיוב / תשלום בהצמדת הנייד לקופה > "הגדרות כרטיס אשראי".'}
        , {'question': 'איפה ניתן לצפות בעסקאות שבוצעו באמצעות כרטיס bitcard?',
           'answer': 'בפיד של אפליקציית bit ,וגם באתר או באפליקציה של חברת כאל.'}

        , {'question': 'איך מחברים את העסק ל-bit',
           'answer': 'ניתן להתחבר באמצעות מספר חברות שיאפשרו לכם לקבל תשלום מלקוחות דרך bit ללא הגבלת סכום. בחרו את החברה שהכי מתאימה לכם וצרו איתה קשר באופן ישיר  '
                     'grow מבית משולם ,PayMe,Upay,גמא ניהול וסליקה,ישראל תורמת,ONE City,מקבוצת Headstart'}
        , {'question': '  קבלת תשלום ב - bitדרך איזי',
           'answer': "בעל עסק? כנראה שהעסק שלך כבר מופיע באיזי!  הצטרף לשירות קבלת תשלום ב-bit באתר איזי באמצעות מאגד  ותוכל לקבל תשלומים ב-bit ללא הגבלה שנתית לרישום https://easy.co.il/easypay-bit "
                     "כדי להתחיל לקבל תשלומים מלקוחות יש להירשם לשירות. לאחר ההרשמה, פרטיך יועברו לחברת הסליקה (PayMe) וכן לחברות האשראי לצורך אימות והרשמה למערכת. לאחר אישור חברת הסליקה (בדרך כלל תוך 2 ימי עסקים) השירות יופעל ובדף העסק שלך באיזי יופיע כפתור תשלום דרכו יוכלו משתמשי איזי לבצע תשלום לעסק."}
        , {'question': 'שכחתי את הסיסמה האישית שלי, מה עליי לעשות?', 'answer': 'עלייך להרשם מחדש לשירות.'}
        , {'question': 'החלפתי מכשיר טלפון, אפשר להתחבר שוב ל- bit?',
           'answer': 'כן. יש להוריד את האפליקציה מחדש, להזדהות באמצעות מספר הטלפון והסיסמא האישית שלך.'}
        , {'question': 'אפשר לשנות את מספר החשבון ופרטי כרטיס האשראי?',
           'answer': 'כן. לאחר לחיצה על צפיה בפרופיל מגיעים למסך בו ניתן לעדכן פרטי כרטיס האשראי ולהוסיף/להסיר חשבון בנק.'}
        , {'question': 'עם איזה כרטיס אשראי אפשר להשתמש כדי להעביר כסף ב- bit?',
           'answer': 'אפשר להעביר כסף באמצעות כרטיס אשראי ישראלי (כולל כרטיסים לחיוב מיידי).'}
        , {'question': 'אפשר להעביר כסף באמצעות כרטיס אשראי של מישהו אחר?',
           'answer': 'לא. העברת כסף צריכה להתבצע באמצעות כרטיס האשראי של המשתמש הרשום לשירות.'}
        , {'question': 'איך אפשר למחוק את הרישום/את הפרופיל?',
           'answer': 'נכנסים ל"צפייה בפרופיל" בצד ימין למעלה במסך הראשי>>>לוחצים על כפתור "מחק פרופיל/רישום מחדש".חשוב להבין! ברגע שמוחקים את הרישום לאפליקציית bit כל היסטורית העברות וקבלות כספים נמחקת גם. אם תרשם מחדש בפעם אחרת, לא תוכל לראות את ההיסטוריה.'}]


def get_documents() -> List[Document]:
    


# Create documents
    documents = [
        Document(
            page_content=doc["answer"],
            metadata={
                "question": doc["question"],
            }
        ) for doc in faqs1
    ]
    return documents


def get_documents() -> List[Document]:
    


# Create documents
    documents = [
        Document(
            page_content=doc["answer"],
            metadata={
                "question": doc["question"],
            }
        ) for doc in faqs1
    ]
    return documents

# import csv
# from typing import List, Tuple

# def get_csv() -> List[Tuple[str, str]]:
#     csv_data = [
#         (doc["question"], doc["answer"]) for doc in faqs1
#     ]
#     return csv_data

# def save_to_csv(data: List[Tuple[str, str]], filename: str):
#     with open(filename, 'w', newline='') as csvfile:
#         writer = csv.writer(csvfile)
#         writer.writerow(['Question', 'Answer'])  # Write the header
#         writer.writerows(data)  # Write the data rows

# # Example usage:
# csv_data = get_csv()
# save_to_csv(csv_data, 'output.csv')